#include "ILIB.h"
//IDAC 클래스명(모듈번호);
//최대 모듈번호는 4개입니다. 
//단, K모듈이 1개일시 최대 Y모듈번호는 2개이고, K모듈이 2개일 시 Y모듈을 사용할 수 없습니다.
IDAC dac1(1);
IDAC dac2(2);
IDAC dac3(3);
IDAC dac4(4);

void setup()
{
  //클래스명.INIT(채널명, 최댓값, 최솟값, 모드변경);
  //모드변경값 설명
  //0으로 설정시 0~5V, 0~10V, 0~10mA,0~20mA 범위 출력
  //1로 설정시 1~5V, 2~10V, 2~10mA, 4~20mA 범위 출력
  /*ex) dac1.INIT(0,100,10,1);
   1번모듈의 0번 채널단자를 최댓값을 100, 최솟값을 10으로 설정하고 출력값은  
   1~5V, 2~10V, 2~10mA, 4~20mA 범위로 출력합니다.*/
  dac1.INIT(0, 50, 0, 0); //클래스명.INIT(채널명, 최댓값, 최솟값, 모드변경);
  dac1.INIT(1, 50, 0, 0);
  dac1.INIT(2, 50, 0, 1); 
  
  dac2.INIT(0, 50, 10, 0);
  dac2.INIT(1, 50, 10, 0);
  dac2.INIT(2, 50, 10, 1);
  
  dac3.INIT(0, 100, 0, 0);
  dac3.INIT(1, 100, 0, 0);
  dac3.INIT(2, 100, 0, 1);
  
  dac4.INIT(0, 100, 20, 0);
  dac4.INIT(1, 100, 20, 0);
  dac4.INIT(2, 100, 20, 1);
}

void loop()
{
  //dac.DACOUT(채널명, 출력값);
  //해당 채널명의 출력을 내보냅니다.  
  /*EX) dac1.DACOUT(0, 15); 
  1번모듈의 0번채널의 출력은 (15-최솟값0) * (5V-0V) / (최댓값50-최솟값0) + 0V =1.5V값이 출력됩니다.*/
  dac1.DACOUT( 0, 5 );   
  //1번모듈 0채널 : ( 5-최솟값0) * (5V-0V) / (최댓값50-최솟값0) + 0V =0.5V출력
  //1번모듈 0채널 : ( 5-최솟값0) * (20mA-0mA) / (최댓값50-최솟값0) + 0mA = 2mA출력
  dac1.DACOUT( 1, 10 );  
  //1번모듈 1채널 : (10-최솟값0) * (5V-0V) / (최댓값50-최솟값0) + 0V =1.0V출력
  //1번모듈 1채널 : (10-최솟값0) * (20mA-0mA) / (최댓값50-최솟값0) + 0mA = 4mA출력
  dac1.DACOUT( 2, 15 );
  //1번모듈 2채널 : (15-최솟값0) * (5V-1V) / (최댓값50-최솟값0) + 1V =2.2V출력
  //1번모듈 2채널 : (15-최솟값0) * (20mA-4mA) / (최댓값50-최솟값0) + 4mA = 8.8mA출력

  dac2.DACOUT( 0, 20 ); 
  //2번모듈 0채널 : ( 20-최솟값10) * (5V-0V) / (최댓값50-최솟값10) + 0V =1.25V출력
  //2번모듈 0채널 : ( 5-최솟값0) * (20mA-0mA) / (최댓값50-최솟값0) + 0mA = 5mA출력
  dac2.DACOUT( 1, 25 );
  //2번모듈 1채널 : ( 25-최솟값10) * (5V-0V) / (최댓값50-최솟값10) + 0V =1.875V출력
  //2번모듈 1채널 : ( 25-최솟값10) * (20mA-0mA) / (최댓값50-최솟값0) + 0mA = 7.5mA출력
  dac2.DACOUT( 2, 30 );
  //2번모듈 2채널 : ( 30-최솟값10) * (5V-1V) / (최댓값50-최솟값10) + 1V =3.0V출력
  //2번모듈 2채널 : ( 30-최솟값10) * (20mA-4mA) / (최댓값50-최솟값10) + 4mA = 12mA출력
 
  dac3.DACOUT( 0, 35 );
  //3번모듈 0채널 : ( 35-최솟값0) * (5V-0V) / (최댓값100-최솟값0) + 0V =1.75V출력
  //3번모듈 0채널 : ( 35-최솟값0) * (20mA-0mA) / (최댓값50-최솟값0) + 0mA = 7mA출력
  dac3.DACOUT( 1, 40 );
  //3번모듈 1채널 : ( 40-최솟값0) * (5V-0V) / (최댓값100-최솟값0) + 0V =2.5V출력
  //3번모듈 1채널 : ( 40-최솟값0) * (20mA-0mA) / (최댓값50-최솟값0) + 0mA = 8mA출력
  dac3.DACOUT( 2, 45 );
  //3번모듈 2채널 : ( 45-최솟값0) * (5V-1V) / (최댓값100-최솟값0) + 1V =2.8V출력
  //3번모듈 2채널 : ( 45-최솟값0) * (20mA-4mA) / (최댓값50-최솟값0) + 4mA = 9.6mA출력

  dac4.DACOUT( 0, 50 ); 
  //4번모듈 0채널 : ( 50-최솟값20) * (5V-0V) / (최댓값100-최솟값20) + 0V =1.875V출력
  //4번모듈 0채널 : ( 50-최솟값20) * (20mA-0mA) / (최댓값50-최솟값20) + 0mA = 7.5mA출력
  dac4.DACOUT( 1, 100 ); 
  //4번모듈 1채널 : (100-최솟값20) * (5V-0V) / (최댓값100-최솟값20) + 0V =5.0V출력
  //4번모듈 1채널 : (100-최솟값20) * (20mA-0mA) / (최댓값50-최솟값20) + 0mA = 20mA출력
  dac4.DACOUT( 2, 50 ); 
  //4번모듈 2채널 : ( 50-최솟값20) * (5V-1V) / (최댓값100-최솟값20) + 1V =2.5V출력
  //4번모듈 2채널 : ( 50-최솟값20) * (20mA-4mA) / (최댓값50-최솟값20) + 4mA = 10mA출력

}
